`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 06.05.2020 18:33:32
// Design Name: 
// Module Name: mainframe
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////


//Модуль mainframe
module mainframe(                           
  input      [9:0]  sw,                     //Ввод переключателей
  input      [4:0]  btn,                    //Ввод кнопок (btn[0]=key0, btn[3]=key1)
  //ВНИМАНИЕ!!! Исправление активного сигнала кнопки на 0 было сделано в модуле debouncer.
  input             clk_50m,                //Ввод тактового сигнала частотой 50 МГц
  output     [9:0]  led,                    //Вывод на светодиоды 
  output reg [6:0]  hex0,                   //Вывод на первый семисигментный индикатор
  output reg [6:0]  hex1,                   //Вывод на второй семисигментный индикатор
  output     [7:0]  hex_on                  //Выбор используемого семисегментного индикатора из 8 (0 - активный)
    );
     
  wire [9:0]register;                //Ввод регистра (последней введённой комбинации переключателей)
  wire [7:0]counter;                 //Ввод счётчика (подсчёт произошедших УС после ввода комбинации перекл. в регистр)
  assign led = register;             //Соединение регистра и вывода на светодиоды
  assign hex_on = 8'b1111_1100;      //Включены первые 
  
  //Ввод/вывод сигналов от модуля hub
  hub u1(                         
    .btn_i(btn[4:0]),
    .sw_i(sw[9:0]),
    .clk_50m(clk_50m),
    .register_o(register[9:0]),
    .counter_o(counter[7:0])
  );
  
  //Обработчик вывода на семисегментные индикаторы:
  always @(*) begin
      case (counter[3:0])        //На первый индикатор выводятся первые 4 бита счётчика
          4'd0  : hex0 = 7'b100_0000;
          4'd1  : hex0 = 7'b111_1001;
          4'd2  : hex0 = 7'b010_0100;
          4'd3  : hex0 = 7'b011_0000;
          4'd4  : hex0 = 7'b001_1001;
          4'd5  : hex0 = 7'b001_0010;
          4'd6  : hex0 = 7'b000_0010;
          4'd7  : hex0 = 7'b111_1000;
          4'd8  : hex0 = 7'b000_0000;
          4'd9  : hex0 = 7'b001_0000;
          4'd10 : hex0 = 7'b000_1000;
          4'd11 : hex0 = 7'b000_0011;
          4'd12 : hex0 = 7'b100_0110;
          4'd13 : hex0 = 7'b010_0001;
          4'd14 : hex0 = 7'b000_0110;
          4'd15 : hex0 = 7'b000_1110;
      endcase
      case (counter[7:4])        //На второй индикатор выводятся вторые 4 бита счётчика
          4'd0  : hex1 = 7'b100_0000;
          4'd1  : hex1 = 7'b111_1001;
          4'd2  : hex1 = 7'b010_0100;
          4'd3  : hex1 = 7'b011_0000;
          4'd4  : hex1 = 7'b001_1001;
          4'd5  : hex1 = 7'b001_0010;
          4'd6  : hex1 = 7'b000_0010;
          4'd7  : hex1 = 7'b111_1000;
          4'd8  : hex1 = 7'b000_0000;
          4'd9  : hex1 = 7'b001_0000;
          4'd10 : hex1 = 7'b000_1000;
          4'd11 : hex1 = 7'b000_0011;
          4'd12 : hex1 = 7'b100_0110;
          4'd13 : hex1 = 7'b010_0001;
          4'd14 : hex1 = 7'b000_0110;
          4'd15 : hex1 = 7'b000_1110;
      endcase
  end
  
endmodule
