`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 06.05.2020 18:33:32
// Design Name: 
// Module Name: mainframe
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////


//Модуль mainframe (префикс - "mainfr")
module mainframe(                           
  input      [9:0]  sw,                     //Ввод переключателей
  input      [4:0]  btn,                    //Ввод кнопок 
  input             clk_50m,               //Ввод тактового сигнала частотой 50 МГц
  output     [9:0]  led,                    //Вывод на светодиоды 
  output reg [6:0]  hex,                    //Вывод на выбранный семисигментный индикатор
  output reg [7:0]  hex_on                  //Выбор используемого семисегментного индикатора из 8 (0 - активный)
    );
     
  wire [9:0]register;                //Ввод регистра (последней введённой комбинации переключателей)
  wire [7:0]counter;                 //Ввод счётчика (подсчёт произошедших УС после ввода комбинации перекл. в регистр)
  assign led = register;             //Соединение регистра и вывода на светодиоды
  
  //Ввод/вывод сигналов от модуля KEY_Switching (префикс - "KS")
  hub u1(                         
    .btn_i(btn[4:0]),
    .sw_i(sw[9:0]),
    .clk_50m(clk_50m),
    .register_o(register[9:0]),
    .counter_o(counter[7:0])
  );
  
  //Обработчик вывода на семисегментные индикаторы:
  //При помощи однобитного регистра, переключающегося 0-1-0... с частотой clk_50m, происходит переключение между двумя индикаторами
  reg disp_selector = 1'd0;          //Однобитный регистр выбора
  always @(posedge clk_50m) begin          //Действия происходят на 0->1 
      disp_selector <= disp_selector + 1'b1; 
      if (disp_selector == 1'b0)
      begin
          hex_on <= 8'b1111_1110;
          case (counter[3:0])        //На первый индикатор выводятся первые 4 бита счётчика
              4'd0  : hex = 7'b100_0000;
              4'd1  : hex = 7'b111_1001;
              4'd2  : hex = 7'b010_0100;
              4'd3  : hex = 7'b011_0000;
              4'd4  : hex = 7'b001_1001;
              4'd5  : hex = 7'b001_0010;
              4'd6  : hex = 7'b000_0010;
              4'd7  : hex = 7'b111_1000;
              4'd8  : hex = 7'b000_0000;
              4'd9  : hex = 7'b001_0000;
              4'd10 : hex = 7'b000_1000;
              4'd11 : hex = 7'b000_0011;
              4'd12 : hex = 7'b100_0110;
              4'd13 : hex = 7'b010_0001;
              4'd14 : hex = 7'b000_0110;
              4'd15 : hex = 7'b000_1110;
          endcase
      end
      
      if (disp_selector == 1'b1)
      begin
          hex_on <= 8'b1111_1101;
          case (counter[7:4])        //На второй индикатор выводятся вторые 4 бита счётчика
              4'd0  : hex = 7'b100_0000;
              4'd1  : hex = 7'b111_1001;
              4'd2  : hex = 7'b010_0100;
              4'd3  : hex = 7'b011_0000;
              4'd4  : hex = 7'b001_1001;
              4'd5  : hex = 7'b001_0010;
              4'd6  : hex = 7'b000_0010;
              4'd7  : hex = 7'b111_1000;
              4'd8  : hex = 7'b000_0000;
              4'd9  : hex = 7'b001_0000;
              4'd10 : hex = 7'b000_1000;
              4'd11 : hex = 7'b000_0011;
              4'd12 : hex = 7'b100_0110;
              4'd13 : hex = 7'b010_0001;
              4'd14 : hex = 7'b000_0110;
              4'd15 : hex = 7'b000_1110;
          endcase
      end    
  end
  
endmodule
